{
  "project": "Boop",
  "branchName": "ralph/epic-4-bridge-and-build",
  "description": "Epic 4: Bridge & Build. Stories convert from BMAD markdown to Ralph's prd.json format. Ralph's execution loop is ported to TypeScript — pick story, implement via Claude API, typecheck, test, reality check, commit, next.",
  "userStories": [
    {
      "id": "4.1",
      "title": "BMAD story markdown parser",
      "description": "As a developer, I want a parser that reads BMAD story markdown files and extracts structured data, so that stories can be converted to Ralph's format.",
      "acceptanceCriteria": [
        "Given a BMAD story markdown file, the parser extracts: story ID, title, user story text, acceptance criteria (as array), tasks/subtasks, dev notes",
        "Handles variations in markdown formatting (different heading levels, bullet styles, optional sections)",
        "Returns a typed TypeScript object",
        "Typecheck passes",
        "All tests pass"
      ],
      "priority": 1,
      "passes": true,
      "notes": "Create src/bridge/parser.ts. The BMAD story markdown format uses: '### Story X.Y: Title', 'As a... I want... So that...', '**Acceptance Criteria:**' with BDD Given/When/Then bullets, '**Prerequisites:**', '**Technical Notes:**'. Test with fixtures covering normal and edge cases. Depends on 1.3 being complete."
    },
    {
      "id": "4.2",
      "title": "Ralph prd.json converter",
      "description": "As a developer, I want the parsed stories converted to Ralph's prd.json format, so that the build loop can consume them.",
      "acceptanceCriteria": [
        "Given parsed story data, generates a valid prd.json with: project, branchName, description, userStories[]",
        "Each story has: id, title, description, acceptanceCriteria[] (including 'Typecheck passes' and 'All tests pass'), priority (from epic ordering), passes (false), notes",
        "The prd.json is saved to .boop/prd.json",
        "Typecheck passes",
        "All tests pass"
      ],
      "priority": 2,
      "passes": true,
      "notes": "Create src/bridge/converter.ts. Takes parsed BMAD stories + project metadata, outputs Ralph-format JSON. Priority maps from epic ordering (epic 1 stories = priority 1-N, etc.). Always appends 'Typecheck passes' and 'All tests pass' to acceptanceCriteria. Depends on 4.1 being complete."
    },
    {
      "id": "4.3",
      "title": "Ralph story execution loop",
      "description": "As a developer, I want Ralph's story loop integrated into Boop, so that stories are built autonomously one at a time.",
      "acceptanceCriteria": [
        "Given a valid .boop/prd.json exists, the loop picks the highest-priority incomplete story",
        "Spawns a fresh Claude context with: story details + progress.txt + CLAUDE.md",
        "The agent implements the story, runs typecheck and tests",
        "Reality check scans for mock/placeholder data, stub implementations, and TODO/FIXME markers in production code paths",
        "On all pass: commits, marks story done in prd.json, appends to progress.txt",
        "On fail (including reality check failures): retries once, then pauses and reports",
        "Mock data in production code is treated as a failing test — not a warning",
        "Typecheck passes",
        "All tests pass"
      ],
      "priority": 3,
      "passes": true,
      "notes": "Create src/build/ralph-loop.ts, src/build/story-runner.ts, src/build/reality-check.ts. IMPORTANT: Use the Anthropic SDK directly (src/shared/claude-client.ts) to invoke Claude for each story — do NOT shell out to 'claude --print' or any CLI tool. The SDK gives proper timeout control, streaming, and error handling without the process-hanging issues of the CLI's --print mode. Each story gets a fresh API conversation. The story runner assembles the prompt (story details + progress.txt + CLAUDE.md context), sends it via the SDK, and processes the response. Reality check runs after typecheck + tests pass but before commit. Depends on 4.2 and 1.4 being complete."
    },
    {
      "id": "4.4",
      "title": "Progress and pattern tracking",
      "description": "As a developer, I want progress.txt and CLAUDE.md maintained across story iterations, so that knowledge compounds between stories.",
      "acceptanceCriteria": [
        "Given a story completes, progress.txt is appended with: iteration number, story ID, files changed, learnings",
        "CLAUDE.md is updated with discovered codebase patterns",
        "Both files are injected into the next story's context",
        "Typecheck passes",
        "All tests pass"
      ],
      "priority": 4,
      "passes": false,
      "notes": "Create src/build/progress.ts. Follow Ralph's existing format: append-only progress log with Codebase Patterns section at the top. The story runner reads progress.txt before each iteration and includes it in the Claude prompt context. CLAUDE.md updates are extracted from the agent's response. Depends on 4.3 being complete."
    },
    {
      "id": "4.5",
      "title": "Git branch management",
      "description": "As a developer, I want Boop to manage git branches for each project, so that work is isolated and organized.",
      "acceptanceCriteria": [
        "Given prd.json has a branchName, the branch is created or checked out when the build phase starts",
        "Each story commit uses format: 'feat: [Story ID] - [Story Title]'",
        "Review phase commits use format: 'refactor: Epic N review - [description]'",
        "Typecheck passes",
        "All tests pass"
      ],
      "priority": 5,
      "passes": false,
      "notes": "Create git utilities in the build module. Use child_process or simple-git for git operations. Branch created from main if it doesn't exist, checked out if it does. Commit format enforced by the story runner. Depends on 4.3 being complete."
    }
  ]
}
