{
  "project": "Boop",
  "branchName": "ralph/epic-6-scaffolding-defaults-security",
  "description": "Epic 6: Scaffolding, Defaults & Security. Projects ship with quality baked in. Agents are sandboxed. Credentials are secure. This epic covers: project scaffolding from the developer profile, SEO/analytics/accessibility defaults for web projects, Docker-based agent sandboxing, credential management with keychain support, and a project retrospective that feeds cross-project learnings into ~/.boop/memory/.",
  "userStories": [
    {
      "id": "6.1",
      "title": "Project scaffolding from profile",
      "description": "As a user, I want Boop to generate a project skeleton based on my developer profile, so that every project starts with my preferred structure and tooling.",
      "acceptanceCriteria": [
        "Given a developer profile exists, when the scaffolding phase runs (after planning, before build), then project structure is generated: directories, configs, boilerplate",
        "Framework, linting, formatting, test runner, and CI config match the profile",
        "Git repo is initialized with initial commit",
        "Typecheck passes",
        "All tests pass"
      ],
      "priority": 1,
      "passes": true,
      "notes": "Create src/scaffolding/generator.ts. Profile-driven template generation. Reads profile fields (preferredFramework, linter, formatter, testRunner, ciProvider) and generates matching configs. Use fs.mkdirSync for directory creation, write package.json, tsconfig.json, .eslintrc/.prettierrc/biome.json, vitest/jest config, GitHub Actions/.gitlab-ci.yml as appropriate. Initialize git repo with execFileSync('git', ['init']) and initial commit. Prerequisites: 2.4 (profile schema), 3.5 (bridge converter)."
    },
    {
      "id": "6.2",
      "title": "SEO and analytics defaults",
      "description": "As a user, I want every web project to ship with SEO optimization and analytics wiring, so that I never have to remember to add these manually.",
      "acceptanceCriteria": [
        "Given the project is a web or mobile-web project (detected from profile/PRD), when scaffolding runs, then SEO defaults are included: meta tags template, Open Graph template, structured data template, sitemap config, robots.txt, semantic HTML patterns",
        "Analytics is wired to the provider specified in the profile",
        "Core Web Vitals monitoring is configured",
        "Typecheck passes",
        "All tests pass"
      ],
      "priority": 2,
      "passes": true,
      "notes": "Create src/scaffolding/defaults/seo.ts and src/scaffolding/defaults/analytics.ts. Only applies to web-type projects (check profile.projectType or PRD analysis). Generate template files: meta tag helpers, OG tag component/partial, JSON-LD structured data template, sitemap generator config, robots.txt. Analytics: support Google Analytics, Plausible, PostHog based on profile.analyticsProvider. CWV: add web-vitals package and reporting hook. Prerequisites: 6.1."
    },
    {
      "id": "6.3",
      "title": "Accessibility and security header defaults",
      "description": "As a user, I want every project to include accessibility defaults and security headers, so that these are always present without thinking about them.",
      "acceptanceCriteria": [
        "Given scaffolding runs, then accessibility defaults are included: ARIA landmarks template, skip navigation component, focus management patterns, semantic HTML guide",
        "Security headers are configured: CSP, HSTS, X-Frame-Options, X-Content-Type-Options",
        "Error tracking setup is included based on profile preference",
        "Typecheck passes",
        "All tests pass"
      ],
      "priority": 3,
      "passes": true,
      "notes": "Create src/scaffolding/defaults/accessibility.ts and src/scaffolding/defaults/security-headers.ts. A11y: generate skip-nav component, ARIA landmark templates, focus-trap utility, color contrast checker config. Security headers: generate middleware/config for CSP, HSTS, X-Frame-Options, X-Content-Type-Options (framework-specific: Express middleware, Next.js headers config, etc.). Error tracking: support Sentry, Bugsnag based on profile.errorTracker. Prerequisites: 6.1."
    },
    {
      "id": "6.4",
      "title": "Agent sandboxing enforcement",
      "description": "As a developer, I want all build and review agents running in Docker sandboxes with restricted access, so that no agent can affect anything outside the project scope.",
      "acceptanceCriteria": [
        "Given a build or review agent is spawned, when it executes, then it runs in a Docker container with filesystem access limited to the project directory",
        "Network access is limited to Claude API only",
        "It cannot install packages from untrusted sources",
        "Destructive actions (force push, rm -rf outside project) are blocked at the runtime level",
        "Typecheck passes",
        "All tests pass"
      ],
      "priority": 4,
      "passes": false,
      "notes": "Create src/sandbox/docker-runner.ts and src/sandbox/policy.ts. Docker runner: spawn containers with --volume for project dir (read-write), --network for Claude API only (use iptables rules or Docker network policy). Policy engine: define allowed/denied commands, blocked file paths (outside project), blocked git operations (force push, reset --hard on main). Wrap execFileSync calls through the policy engine. For testing, use a mock Docker interface. Prerequisites: 1.1 (OpenClaw sandbox patterns), 4.3 (build agents)."
    },
    {
      "id": "6.5",
      "title": "Credential management and security audit",
      "description": "As a developer, I want API keys stored securely and a security checklist validated before release, so that Boop is safe to distribute.",
      "acceptanceCriteria": [
        "Given Boop requires a Claude API key, when the key is configured, then it's stored in ~/.boop/credentials/ with 0600 permissions or system keychain",
        "The key is never written to project files or logs",
        "A security audit checklist covers: sandbox boundaries, credential handling, destructive action guardrails, network access restrictions",
        "Typecheck passes",
        "All tests pass"
      ],
      "priority": 5,
      "passes": false,
      "notes": "Create src/security/credentials.ts and src/security/audit-checklist.ts. Credentials: store API keys in ~/.boop/credentials/anthropic.key with fs.chmodSync(path, 0o600). Load via environment variable first (ANTHROPIC_API_KEY), fall back to credential file. Never log or write keys to project files (reuse the sanitize() function from logger.ts). Audit checklist: programmatic checks that verify sandbox config exists, credentials have correct permissions, logger has credential filtering, git hooks prevent secret commits. Prerequisites: 6.4."
    },
    {
      "id": "6.6",
      "title": "Project retrospective and self-improvement analysis",
      "description": "As a user, I want Boop to analyze the full build history after the final epic and generate improvement suggestions, so that each project makes Boop smarter for the next one.",
      "acceptanceCriteria": [
        "Given the final epic's sign-off is approved, when the retrospective phase runs, then it walks the full build history: progress.txt, review findings per epic, git log, iteration counts per story, reality check failures, gap analysis results, security scan findings",
        "Identifies patterns: stories that needed multiple iterations (and why), most common review findings, where mock data slipped through, recurring vulnerability patterns",
        "Generates retrospective.md with: build statistics, failure pattern analysis, prompt quality assessment, and concrete pipeline improvement suggestions",
        "Saves actionable cross-project learnings to ~/.boop/memory/ as structured YAML",
        "Presents the retrospective summary to the user as the final project output",
        "The pipeline transitions to COMPLETE after the retrospective is presented",
        "Typecheck passes",
        "All tests pass"
      ],
      "priority": 6,
      "passes": false,
      "notes": "Create src/retrospective/analyzer.ts and src/retrospective/reporter.ts. Analyzer: read .boop/reviews/ for all epic review data, scripts/ralph/progress.txt for build learnings, git log for iteration counts. Compute: stories per epic, avg iterations per story, most common finding categories, gap patterns, security patterns. Reporter: generate retrospective.md with statistics tables, pattern analysis, prompt quality assessment (which story descriptions led to fewest iterations), improvement suggestions. Memory: save to ~/.boop/memory/ as YAML keyed by pattern type. Pipeline: add RETROSPECTIVE state between SIGN_OFF and COMPLETE in the state machine. Prerequisites: 6.5, 5.8."
    }
  ]
}
